<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"http","label":"production","backend":"a6956a39cb6587f07be5a90e822574fc39dd3a96b235cb2095bf9574da84ed42","plan_job_ref":"Job Cloudflare Infra #91 at https://github.com/SableClient/Sable/actions/runs/23473800147","plan_out_hash":"344c9c8291e01db14e2a6b4f667210a2a1591aab9458608ca610e624cedd3581","plan_hash":"16c75169da79b92edbb7e053d7d518f3012f7579cc0c29d9b0e550a0ccf71710","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 1 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # cloudflare_worker_version.site must be replaced
-/+ resource "cloudflare_worker_version" "site" {
!~      annotations         = {
+           workers_message      = (known after apply)
+           workers_tag          = (known after apply)
!~          workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
!~      assets              = { # forces replacement
!~          asset_manifest_sha256 = "85d41748d15e9333782847f711e6a74e07fc2e0f53c20d5baf28d113bcd6814e" -> "c9a98afc858aab4444e95634e785ce2e67155f643cd01077b318db4e93eeaf18" # forces replacement
!~          directory             = "/home/runner/work/Sable/Sable/dist" -> "/github/workspace/dist"
#            (1 unchanged attribute hidden)
        }
+       compatibility_flags = (known after apply)
!~      created_on          = "2026-03-24T04:50:29Z" -> (known after apply)
!~      id                  = "************************************" -> (known after apply)
+       limits              = (known after apply)
+       main_script_base64  = (known after apply)
!~      number              = 524 -> (known after apply)
!~      source              = "terraform" -> (known after apply)
+       startup_time_ms     = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # cloudflare_workers_deployment.site will be created
+   resource "cloudflare_workers_deployment" "site" {
+       account_id   = (sensitive value)
+       annotations  = {
+           workers_message      = "Update cloudflare-web-deploy.yml"
+           workers_triggered_by = (known after apply)
        }
+       author_email = (known after apply)
+       created_on   = (known after apply)
+       id           = (known after apply)
+       script_name  = "sable"
+       source       = (known after apply)
+       strategy     = "percentage"
+       versions     = [
+           {
+               percentage = 100
+               version_id = (known after apply)
            },
        ]
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Attribute Deprecated

  with cloudflare_workers_custom_domain.site,
  on main.tf line 41, in resource "cloudflare_workers_custom_domain" "site":
  41:   environment = "production"

This attribute is deprecated.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Cloudflare Infra #91](https://github.com/SableClient/Sable/actions/runs/23473800147)